backend/app/Http/Controllers/Owner/OwnersController.php

select * from `submissions`
---
  public function index()
  {
    $submissions = Submission::all();