backend/app/Http/Controllers/SubmissionController.php

insert into `submissions` (`distance`, `contents`, `thoughts`, `user_id`, `updated_at`, `created_at`) values ('5', 'test1212', 'test1212', 1, '2021-12-02 14:43:49', '2021-12-02 14:43:49')
---
      public function send(Request $request)
      {

        $submission = new Submission();

        $submission->distance = $request->distance;
        $submission->contents = $request->contents;
        $submission->thoughts = $request->thoughts;
        $submission->user_id = $request->user()->id;



        if($request->has("back")) {
          return redirect()->route('user.submissions.index')
              ->withInput();
        } else {
          $submission->save();